IdeaRS.OpenModel.Material.MatConcreteEc2
Material concrete Ec2
This sample shows how to create concrete material.
//Creating the model
OpenModel openModel = new OpenModel();
//Cocrete material
MatConcreteEc2 mat = new MatConcreteEc2();
mat.Name = "Concrete1";
mat.UnitMass = 2500.0;
mat.E = 32.8e9;
mat.G = 13.667e9;
mat.Poisson = 0.2;
mat.SpecificHeat = 0.6;
mat.ThermalExpansion = 0.00001;
mat.ThermalConductivity = 45;
mat.Fck = 25.5e6;
mat.CalculateDependentValues = true;
//Set s-s diagram as a default parabolic
mat.DiagramType = ConcDiagramType.Parabolic;
//Set s-s diagram as an user defined
mat.DiagramType = ConcDiagramType.DefinedByUser;
var userDiagram = new Polygon2D();
mat.UserDiagram = userDiagram;
userDiagram.Points.Add(new Point2D() { X = -0.021, Y = 0 });
userDiagram.Points.Add(new Point2D() { X = -0.02, Y = 0 });
userDiagram.Points.Add(new Point2D() { X = -0.0025, Y = -80000000});
userDiagram.Points.Add(new Point2D() { X = -0.0024, Y = -79868660.43});
userDiagram.Points.Add(new Point2D() { X = -0.0023, Y = -79461961.9 });
userDiagram.Points.Add(new Point2D() { X = -0.0022, Y = -78762709.44});
userDiagram.Points.Add(new Point2D() { X = -0.0021, Y = -77756658.69});
userDiagram.Points.Add(new Point2D() { X = -0.0019, Y = -74785483.74	});
userDiagram.Points.Add(new Point2D() { X = -0.0017, Y = -70514061.33	});
userDiagram.Points.Add(new Point2D() { X = -0.0015, Y = -64981949.46	});
userDiagram.Points.Add(new Point2D() { X = -0.001	, Y = -46511627.91	});
userDiagram.Points.Add(new Point2D() { X = -0.0005, Y = -23904382.47	});
userDiagram.Points.Add(new Point2D() { X = 0, Y = 0});
userDiagram.Points.Add(new Point2D() { X = 0.001, Y = 0 });
//Setting thermal characteristcs of material (in this case by the code)
mat.StateOfThermalConductivity = ThermalConductivityState.Code;
mat.StateOfThermalExpansion = ThermalExpansionState.Code;
mat.StateOfThermalSpecificHeat = ThermalSpecificHeatState.Code;
mat.StateOfThermalStressStrain = ThermalStressStrainState.Code;
openModel.AddObject(mat);

IdeaRS.OpenModel.Material.MatConcreteEc2.CalculateDependentValues
Setting calculation dependent values on fck

IdeaRS.OpenModel.Material.MatConcreteEc2.Fck
Characteristic compressive cylinder strength of concrete at 28 days - fck

IdeaRS.OpenModel.Material.MatConcreteEc2.Ecm
Secant modulus of elasticity of concrete - Ecm

IdeaRS.OpenModel.Material.MatConcreteEc2.Epsc1
Compressive strain in the concrete - εc1

IdeaRS.OpenModel.Material.MatConcreteEc2.Epsc2
Compressive strain in the concrete - εc2

IdeaRS.OpenModel.Material.MatConcreteEc2.Epsc3
Compressive strain in the concrete - εc3

IdeaRS.OpenModel.Material.MatConcreteEc2.Epscu1
Ultimate compressive strain in the concrete - εcu1

IdeaRS.OpenModel.Material.MatConcreteEc2.Epscu2
Ultimate compressive strain in the concrete - εcu2

IdeaRS.OpenModel.Material.MatConcreteEc2.Epscu3
Ultimate compressive strain in the concrete - εcu3

IdeaRS.OpenModel.Material.MatConcreteEc2.Fctm
Mean value of axial tensile strength of concrete - fctm

IdeaRS.OpenModel.Material.MatConcreteEc2.Fctk_0_05
Characteristic axial tensile strength of concrete 5% quantile - fctk,0,05

IdeaRS.OpenModel.Material.MatConcreteEc2.Fctk_0_95
Characteristic axial tensile strength of concrete 95% quantile - fctk,0,95

IdeaRS.OpenModel.Material.MatConcreteEc2.NFactor
Coefficient n-factor - necessary parabolic part of stress-strain diagram - n

IdeaRS.OpenModel.Material.MatConcreteEc2.Fcm
Mean value of concrete cylinder compressive strength - fcm

IdeaRS.OpenModel.Material.MatConcreteEc2.StoneDiameter
Diameter of stone

IdeaRS.OpenModel.Material.MatConcreteEc2.CementClass
Type of cement class

IdeaRS.OpenModel.Material.MatConcreteEc2.AggregateType
Type of aggregate

IdeaRS.OpenModel.Material.MatConcreteEc2.DiagramType
Type of stress-strain diagram bilinear/parabolic/general for ULS calculation

IdeaRS.OpenModel.Material.MatConcreteEc2.SilicaFume
Contains silica fume

IdeaRS.OpenModel.Material.MatConcreteEc2.PlainConcreteDiagram
Stress strain diagram with tension part

IdeaRS.OpenModel.Material.MatConcreteEc2.UserDiagram
Stress-strain diagram defined by user